# Project 2 Part 3B
**Transform and Load (core)**


*Christina Brockway*

### Task
- Take the cleaned data and add stakeholder data to SQL database
- Genres
    -  use title basics from part 1
    -  extract and normalize column
- New Table from API calls
    -  Tmdb_data table
        -  imdb_id
        -  revenue
        -  budget
        -  certification

### Imports

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import json, os
import plotly.express as px
from sqlalchemy.engine import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus
from sqlalchemy.types import *

In [2]:
#Mysql login
with open("/Users/csbro/.secret/mysql.json", "r") as f:
          login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

### Load data and Inspect

In [3]:
basics = pd.read_csv('data/basics-filtered.csv')

In [4]:
basics.head(2)

,Unnamed: 0,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,34800,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,61111,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama

In [5]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86972 entries, 0 to 86971
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      86972 non-null  int64
 1   tconst          86972 non-null  object
 2   titleType       86972 non-null  object
 3   primaryTitle    86972 non-null  object
 4   originalTitle   86972 non-null  object
 5   isAdult         86972 non-null  int64
 6   startYear       86972 non-null  float64
 7   endYear         0 non-null      float64
 8   runtimeMinutes  86972 non-null  int64
 9   genres          86972 non-null  object
dtypes: float64(2), int64(3), object(5)
memory usage: 6.6+ MB

## Normalize Data

### Generes

In [6]:
# screate a new column with a list of genres
basics['genres_split']= basics['genres'].str.split(",")
basics.head(2)

,Unnamed: 0,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,34800,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,61111,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]

In [7]:
basics=basics.drop(columns='Unnamed: 0')
basics.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]

In [8]:
#Seperate list of genres
exploded_genres = basics.explode('genres_split')
exploded_genres.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy

In [9]:
#get unique genres from the split
unique_genres =  sorted(exploded_genres['genres_split'].unique())

In [10]:
# Create new table for title_genres
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head(2)

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy

In [11]:
#Create a gene mapper dictionary
genre_init = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_init))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [12]:
#Add genres_id column
title_genres['genres_id'] = title_genres['genres_split'].map(genre_map)
#Drop genres split column
title_genres = title_genres.drop(columns='genres_split')
title_genres.head(2)

      tconst  genres_id
0  tt0035423          5
0  tt0035423          9

### Genres Dataframe

In [37]:
#Make a dataframe with named cols from the keys and values
genres = pd.DataFrame({"genre_name": genre_map.keys(),
                             "genre_id": genre_map.values()})
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

### Create DB and Normalize/Transform

### tmdb_data table Created Using Python

#### Load tmdb_data

In [14]:
#create connection with MySQL

#Define database
dbase = 'movies'

# Define your login credentials
username = 'your_username'
password = 'your_password'

# Create the connection string
connection = f'mysql+pymysql://{username}:{password}@localhost/{dbase}'

# Create the database engine
engine = create_engine(connection)

# Connect to the database
engine = engine.connect()

#### Create tmdb_data table

In [ ]:
#Defining Columns
data = {'imdb_id': [],
    'revenue': [],
    'budget': [],
    'certification':[]}

#create datafrome
tmdb_df = pd.DataFrame(data)
tmdb_df

#### Look for len values for keys

In [17]:
id_len =tmdb_df['imdb_id'].fillna("").map(len).max()
id_len

NameError: name 'tmdb_df' is not defined

In [ ]:
cert_len = tmdb_df['certification'].fillna("").map(len).max()
cert_len

In [ ]:
## Make a dictionary with column and datatypes
tmdb_types = {'imdb_id':CHAR(15),
              'revenue':FLOAT(),
              'budget':FLOAT(),
              'certification':VARCHAR(10)}

#### Preparing Data for Importing

In [19]:
q="""
SHOW TABLES;
"""
pd.read_sql(q, engine)

  Tables_in_movies
0           basics
1           genres
2          ratings
3     title_genres
4        tmdb_data

In [20]:
#display tmdb_data info
q = """
DESCRIBE tmdb_data;
"""

pd.read_sql(q, engine)

           Field    Type Null Key Default Extra
0         tconst    text  YES        None
1  primary_title    text  YES        None
2     start_year  double  YES        None
3   runtime_mins  bigint  YES        None

In [21]:
#read in data from basics
basics_data = pd.read_csv('MovieData/basics_data.csv.gz')

In [22]:
basics_data.to_sql('basics', conn, index=False, if_exists='append')

86972

In [23]:
#confirm data has been added
q= """
SELECT * FROM basics
LIMIT 5;
"""
pd.read_sql(q, engine)

,tconst,primary_title,start_year,runtime_mins
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0068865,Lives of Performers,2016.0,90
3,tt0069049,The Other Side of the Wind,2018.0,122
4,tt0088751,The Naked Monster,2005.0,100

In [24]:
basics.to_csv(f"MovieData/basics_data3B.csv.gz", compression = 'gzip', index=False)

##### ratings

In [25]:
#read in data from ratings
ratings_data = pd.read_csv('MovieData/ratings_data.csv.gz')

In [26]:
#Load ratings table
ratings_data.to_sql("ratings", engine, index=False, if_exists='append')

71904

In [27]:
#display ratings db info
q = """
DESCRIBE ratings;
"""

pd.read_sql(q, engine)

        Field    Type Null Key Default Extra
0      tconst    text  YES        None
1  avg_rating  double  YES        None
2   num_votes  bigint  YES        None

In [28]:
#confirm data has been added
q= """
SELECT * FROM ratings
LIMIT 5;
"""
pd.read_sql(q, engine)

      tconst  avg_rating  num_votes
0  tt0035423         6.4      87153
1  tt0062336         6.4        175
2  tt0068865         5.4         74
3  tt0069049         6.7       7754
4  tt0088751         5.2        336

In [29]:
ratings_data.to_csv(f"MovieData/ratings_data3B.csv.gz", compression = 'gzip', index=False)

##### Genres

NameError: name 'describe' is not defined

In [39]:
#display genres db info
q = """
DESCRIBE genres;
"""

pd.read_sql(q, engine)

                    Field    Type Null Key Default Extra
0                 imdb_id    text  YES        None
1                   adult  double  YES        None
2           backdrop_path    text  YES        None
3   belongs_to_collection    text  YES        None
4                  budget  double  YES        None
5                  genres    text  YES        None
6                homepage    text  YES        None
7                      id  double  YES        None
8       original_language    text  YES        None
9          original_title    text  YES        None
10               overview    text  YES        None
11             popularity  double  YES        None
12            poster_path    text  YES        None
13   production_companies    text  YES        None
14   production_countries    text  YES        None
15           release_date    text  YES        None
16                revenue  double  YES        None
17                runtime  double  YES        None
18       spoken_languages    text  YES        None
19                 status    text  YES        None
20                tagline    text  YES        None
21                  title    text  YES        None
22                  video  double  YES        None
23           vote_average  double  YES        None
24             vote_count  double  YES        None
25          certification    text  YES        None

In [42]:
genres.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   genre_name  25 non-null     object
 1   genre_id    25 non-null     int64
dtypes: int64(1), object(1)
memory usage: 528.0+ bytes

##### title_genres

In [33]:
#display title_genres db info
q = """
DESCRIBE title_genres;
"""

pd.read_sql(q, engine)

                    Field    Type Null Key Default Extra
0                 imdb_id    text  YES        None
1                   adult  double  YES        None
2           backdrop_path    text  YES        None
3   belongs_to_collection    text  YES        None
4                  budget  double  YES        None
5                  genres    text  YES        None
6                homepage    text  YES        None
7                      id  double  YES        None
8       original_language    text  YES        None
9          original_title    text  YES        None
10               overview    text  YES        None
11             popularity  double  YES        None
12            poster_path    text  YES        None
13   production_companies    text  YES        None
14   production_countries    text  YES        None
15           release_date    text  YES        None
16                revenue  double  YES        None
17                runtime  double  YES        None
18       spoken_languages    text  YES        None
19                 status    text  YES        None
20                tagline    text  YES        None
21                  title    text  YES        None
22                  video  double  YES        None
23           vote_average  double  YES        None
24             vote_count  double  YES        None
25          certification    text  YES        None

In [34]:
#.to_sql("title_genres", engine, index=False, if_exists='append')

##### tmdb_data

In [35]:
#display tmdb_data db info
q = """
DESCRIBE tmdb_data;
"""

pd.read_sql(q, engine)

           Field      Type Null  Key Default Extra
0        imdb_id  char(15)   NO  PRI    None
1        revenue     float  YES         None
2         budget     float  YES         None
3  certification  char(10)  YES         None

In [36]:
#confirm data has been added
q= """
SELECT * FROM tmdb_data
LIMIT 5;
"""
pd.read_sql(q, engine)

Empty DataFrame
Columns: [imdb_id, revenue, budget, certification]
Index: []